ingestion-api/perf/wrk2/output/2016-03-08-v0.5.7.0-perf-001-events-output.txt
Running 50s test @ http://127.0.0.1:9000/v1/events
  5 threads and 100 connections
  Thread calibration: mean lat.: 1.576ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.455ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.433ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.446ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 4.834ms, rate sampling interval: 12ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.53ms  697.70us   7.32ms   73.23%
    Req/Sec   423.37    285.76     1.82k    84.36%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.43ms
 75.000%    1.88ms
 90.000%    2.38ms
 99.000%    3.94ms
 99.900%    5.24ms
 99.990%    6.44ms
 99.999%    7.25ms
100.000%    7.32ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.183     0.000000            1         1.00
       0.748     0.100000         8000         1.11
       0.953     0.200000        15962         1.25
       1.125     0.300000        23951         1.43
       1.285     0.400000        31984         1.67
       1.434     0.500000        39906         2.00
       1.511     0.550000        43940         2.22
       1.590     0.600000        47889         2.50
       1.676     0.650000        51913         2.86
       1.772     0.700000        55887         3.33
       1.876     0.750000        59857         4.00
       1.935     0.775000        61848         4.44
       2.000     0.800000        63848         5.00
       2.075     0.825000        65862         5.71
       2.159     0.850000        67830         6.67
       2.259     0.875000        69853         8.00
       2.315     0.887500        70846         8.89
       2.381     0.900000        71840        10.00
       2.449     0.912500        72834        11.43
       2.523     0.925000        73815        13.33
       2.617     0.937500        74821        16.00
       2.673     0.943750        75312        17.78
       2.741     0.950000        75813        20.00
       2.821     0.956250        76315        22.86
       2.915     0.962500        76812        26.67
       3.047     0.968750        77315        32.00
       3.121     0.971875        77560        35.56
       3.211     0.975000        77805        40.00
       3.317     0.978125        78055        45.71
       3.435     0.981250        78308        53.33
       3.579     0.984375        78557        64.00
       3.669     0.985938        78678        71.11
       3.777     0.987500        78809        80.00
       3.887     0.989062        78928        91.43
       3.977     0.990625        79054       106.67
       4.103     0.992188        79178       128.00
       4.175     0.992969        79242       142.22
       4.251     0.993750        79306       160.00
       4.323     0.994531        79366       182.86
       4.403     0.995313        79428       213.33
       4.507     0.996094        79490       256.00
       4.551     0.996484        79520       284.44
       4.631     0.996875        79551       320.00
       4.695     0.997266        79584       365.71
       4.819     0.997656        79614       426.67
       4.935     0.998047        79646       512.00
       4.987     0.998242        79661       568.89
       5.031     0.998437        79676       640.00
       5.119     0.998633        79692       731.43
       5.187     0.998828        79709       853.33
       5.267     0.999023        79723      1024.00
       5.307     0.999121        79730      1137.78
       5.343     0.999219        79738      1280.00
       5.443     0.999316        79746      1462.86
       5.519     0.999414        79754      1706.67
       5.623     0.999512        79762      2048.00
       5.655     0.999561        79765      2275.56
       5.711     0.999609        79769      2560.00
       5.763     0.999658        79773      2925.71
       5.919     0.999707        79777      3413.33
       6.195     0.999756        79781      4096.00
       6.259     0.999780        79783      4551.11
       6.295     0.999805        79785      5120.00
       6.347     0.999829        79787      5851.43
       6.403     0.999854        79789      6826.67
       6.431     0.999878        79791      8192.00
       6.443     0.999890        79794      9102.22
       6.443     0.999902        79794     10240.00
       6.443     0.999915        79794     11702.86
       6.591     0.999927        79795     13653.33
       6.671     0.999939        79796     16384.00
       6.671     0.999945        79796     18204.44
       6.675     0.999951        79797     20480.00
       6.675     0.999957        79797     23405.71
       6.683     0.999963        79798     27306.67
       6.683     0.999969        79798     32768.00
       6.683     0.999973        79798     36408.89
       7.251     0.999976        79799     40960.00
       7.251     0.999979        79799     46811.43
       7.251     0.999982        79799     54613.33
       7.251     0.999985        79799     65536.00
       7.251     0.999986        79799     72817.78
       7.319     0.999988        79800     81920.00
       7.319     1.000000        79800          inf
#[Mean    =        1.526, StdDeviation   =        0.698]
#[Max     =        7.316, Total count    =        79800]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  99572 requests in 50.01s, 26.40MB read
Requests/sec:   1991.22
Transfer/sec:    540.59KB