ingestion-api/perf/wrk2/output/2016-03-08-v0.5.7.0-perf-100-events-output.txt
Running 50s test @ http://127.0.0.1:9000/v1/events
  5 threads and 100 connections
  Thread calibration: mean lat.: 4684.047ms, rate sampling interval: 16121ms
  Thread calibration: mean lat.: 4661.689ms, rate sampling interval: 16039ms
  Thread calibration: mean lat.: 4675.388ms, rate sampling interval: 16121ms
  Thread calibration: mean lat.: 4677.323ms, rate sampling interval: 16138ms
  Thread calibration: mean lat.: 4670.915ms, rate sampling interval: 16138ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    26.56s    10.11s   46.66s    57.38%
    Req/Sec    48.20      0.75    49.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   26.51s 
 75.000%   35.39s 
 90.000%   40.63s 
 99.000%   43.61s 
 99.900%   44.92s 
 99.990%   46.69s 
 99.999%   46.69s 
100.000%   46.69s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    8929.279     0.000000            1         1.00
   12599.295     0.100000          986         1.11
   16056.319     0.200000         1968         1.25
   19578.879     0.300000         2956         1.43
   23085.055     0.400000         3940         1.67
   26509.311     0.500000         4920         2.00
   28213.247     0.550000         5410         2.22
   30015.487     0.600000         5902         2.50
   31834.111     0.650000         6396         2.86
   33521.663     0.700000         6888         3.33
   35389.439     0.750000         7382         4.00
   36339.711     0.775000         7624         4.44
   37224.447     0.800000         7874         5.00
   38010.879     0.825000         8122         5.71
   38928.383     0.850000         8364         6.67
   39682.047     0.875000         8609         8.00
   40206.335     0.887500         8733         8.89
   40632.319     0.900000         8863        10.00
   41156.607     0.912500         8982        11.43
   41484.287     0.925000         9100        13.33
   41943.039     0.937500         9236        16.00
   42074.111     0.943750         9286        17.78
   42369.023     0.950000         9349        20.00
   42532.863     0.956250         9420        22.86
   42663.935     0.962500         9474        26.67
   42926.079     0.968750         9533        32.00
   43024.383     0.971875         9562        35.56
   43089.919     0.975000         9596        40.00
   43188.223     0.978125         9632        45.71
   43253.759     0.981250         9670        53.33
   43352.063     0.984375         9688        64.00
   43417.599     0.985938         9700        71.11
   43515.903     0.987500         9720        80.00
   43581.439     0.989062         9732        91.43
   43646.975     0.990625         9744       106.67
   43679.743     0.992188         9770       128.00
   43679.743     0.992969         9770       142.22
   43712.511     0.993750         9786       160.00
   43712.511     0.994531         9786       182.86
   43745.279     0.995313         9803       213.33
   43745.279     0.996094         9803       256.00
   43745.279     0.996484         9803       284.44
   43778.047     0.996875         9812       320.00
   43778.047     0.997266         9812       365.71
   43810.815     0.997656         9818       426.67
   43810.815     0.998047         9818       512.00
   43974.655     0.998242         9820       568.89
   44302.335     0.998437         9822       640.00
   44695.551     0.998633         9824       731.43
   44924.927     0.998828         9826       853.33
   45350.911     0.999023         9828      1024.00
   45350.911     0.999121         9828      1137.78
   45645.823     0.999219         9830      1280.00
   45645.823     0.999316         9830      1462.86
   46039.039     0.999414         9832      1706.67
   46039.039     0.999512         9832      2048.00
   46039.039     0.999561         9832      2275.56
   46268.415     0.999609         9834      2560.00
   46268.415     0.999658         9834      2925.71
   46268.415     0.999707         9834      3413.33
   46268.415     0.999756         9834      4096.00
   46268.415     0.999780         9834      4551.11
   46694.399     0.999805         9836      5120.00
   46694.399     1.000000         9836          inf
#[Mean    =    26556.525, StdDeviation   =    10110.060]
#[Max     =    46661.632, Total count    =         9836]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  12127 requests in 50.02s, 3.22MB read
Requests/sec:    242.44
Transfer/sec:     65.82KB